RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/IAR/startup_hc32f448.s
                PUBWEAK DMA1_TC2_BTC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC2_BTC2_Handler
                B       DMA1_TC2_BTC2_Handler

                PUBWEAK DMA1_TC3_BTC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC3_BTC3_Handler
                B       DMA1_TC3_BTC3_Handler

                PUBWEAK DMA1_TC4_BTC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC4_BTC4_Handler
                B       DMA1_TC4_BTC4_Handler

                PUBWEAK DMA1_TC5_BTC5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC5_BTC5_Handler
                B       DMA1_TC5_BTC5_Handler

                PUBWEAK EFM_PEError_ReadCol_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EFM_PEError_ReadCol_Handler
                B       EFM_PEError_ReadCol_Handler

                PUBWEAK EFM_OpEnd_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EFM_OpEnd_Handler
                B       EFM_OpEnd_Handler

                PUBWEAK QSPI_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
QSPI_Handler
                B       QSPI_Handler

                PUBWEAK DCU1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU1_Handler
                B       DCU1_Handler

                PUBWEAK DCU2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU2_Handler
                B       DCU2_Handler

                PUBWEAK DCU3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU3_Handler
                B       DCU3_Handler

                PUBWEAK DCU4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU4_Handler
                B       DCU4_Handler

                PUBWEAK DMA2_Error_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_Error_Handler
                B       DMA2_Error_Handler

                PUBWEAK DMA2_TC0_BTC0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC0_BTC0_Handler
                B       DMA2_TC0_BTC0_Handler

                PUBWEAK DMA2_TC1_BTC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC1_BTC1_Handler
                B       DMA2_TC1_BTC1_Handler

                PUBWEAK DMA2_TC2_BTC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC2_BTC2_Handler
                B       DMA2_TC2_BTC2_Handler

                PUBWEAK DMA2_TC3_BTC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC3_BTC3_Handler
                B       DMA2_TC3_BTC3_Handler

                PUBWEAK DMA2_TC4_BTC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC4_BTC4_Handler
                B       DMA2_TC4_BTC4_Handler

                PUBWEAK DMA2_TC5_BTC5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC5_BTC5_Handler
                B       DMA2_TC5_BTC5_Handler

                PUBWEAK TMR0_1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR0_1_Handler
                B       TMR0_1_Handler

                PUBWEAK TMR0_2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR0_2_Handler
                B       TMR0_2_Handler

                PUBWEAK RTC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
RTC_Handler
                B       RTC_Handler

                PUBWEAK CLK_XtalStop_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CLK_XtalStop_Handler
                B       CLK_XtalStop_Handler

                PUBWEAK PWC_WKTM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_WKTM_Handler
                B       PWC_WKTM_Handler

                PUBWEAK SWDT_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SWDT_Handler
                B       SWDT_Handler

                PUBWEAK TMR6_1_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_GCmp_Handler
                B       TMR6_1_GCmp_Handler

                PUBWEAK TMR6_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_Ovf_Udf_Handler
                B       TMR6_1_Ovf_Udf_Handler

                PUBWEAK TMR6_1_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_Dte_Handler
                B       TMR6_1_Dte_Handler

                PUBWEAK TMR6_1_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_SCmp_Handler
                B       TMR6_1_SCmp_Handler

                PUBWEAK TMRA_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_1_Ovf_Udf_Handler
                B       TMRA_1_Ovf_Udf_Handler

                PUBWEAK TMRA_1_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_1_Cmp_Handler
                B       TMRA_1_Cmp_Handler

                PUBWEAK TMR6_2_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_GCmp_Handler
                B       TMR6_2_GCmp_Handler

                PUBWEAK TMR6_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_Ovf_Udf_Handler
                B       TMR6_2_Ovf_Udf_Handler

                PUBWEAK TMR6_2_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_Dte_Handler
                B       TMR6_2_Dte_Handler

                PUBWEAK TMR6_2_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_SCmp_Handler
                B       TMR6_2_SCmp_Handler

                PUBWEAK TMRA_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_2_Ovf_Udf_Handler
                B       TMRA_2_Ovf_Udf_Handler

                PUBWEAK TMRA_2_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_2_Cmp_Handler
                B       TMRA_2_Cmp_Handler

                PUBWEAK TMRA_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_3_Ovf_Udf_Handler
                B       TMRA_3_Ovf_Udf_Handler

                PUBWEAK TMRA_3_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_3_Cmp_Handler
                B       TMRA_3_Cmp_Handler

