RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/IAR/startup_hc32f448.s
                PUBWEAK TMRA_4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_4_Ovf_Udf_Handler
                B       TMRA_4_Ovf_Udf_Handler

                PUBWEAK TMRA_4_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_4_Cmp_Handler
                B       TMRA_4_Cmp_Handler

                PUBWEAK TMR4_1_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_1_GCmp_Handler
                B       TMR4_1_GCmp_Handler

                PUBWEAK TMR4_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_1_Ovf_Udf_Handler
                B       TMR4_1_Ovf_Udf_Handler

                PUBWEAK TMR4_1_Reload_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_1_Reload_Handler
                B       TMR4_1_Reload_Handler

                PUBWEAK TMR4_1_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_1_SCmp_Handler
                B       TMR4_1_SCmp_Handler

                PUBWEAK TMR4_2_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_2_GCmp_Handler
                B       TMR4_2_GCmp_Handler

                PUBWEAK TMR4_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_2_Ovf_Udf_Handler
                B       TMR4_2_Ovf_Udf_Handler

                PUBWEAK TMR4_2_Reload_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_2_Reload_Handler
                B       TMR4_2_Reload_Handler

                PUBWEAK TMR4_2_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_2_SCmp_Handler
                B       TMR4_2_SCmp_Handler

                PUBWEAK TMR4_3_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_3_GCmp_Handler
                B       TMR4_3_GCmp_Handler

                PUBWEAK TMR4_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_3_Ovf_Udf_Handler
                B       TMR4_3_Ovf_Udf_Handler

                PUBWEAK TMR4_3_Reload_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_3_Reload_Handler
                B       TMR4_3_Reload_Handler

                PUBWEAK TMR4_3_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_3_SCmp_Handler
                B       TMR4_3_SCmp_Handler

                PUBWEAK I2C1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_Handler
                B       I2C1_Handler

                PUBWEAK I2C2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_Handler
                B       I2C2_Handler

                PUBWEAK CMP1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP1_Handler
                B       CMP1_Handler

                PUBWEAK CMP2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP2_Handler
                B       CMP2_Handler

                PUBWEAK CMP3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP3_Handler
                B       CMP3_Handler

                PUBWEAK CMP4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP4_Handler
                B       CMP4_Handler

                PUBWEAK USART1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_Handler
                B       USART1_Handler

                PUBWEAK USART1_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_TxComplete_Handler
                B       USART1_TxComplete_Handler

                PUBWEAK USART2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART2_Handler
                B       USART2_Handler

                PUBWEAK USART2_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART2_TxComplete_Handler
                B       USART2_TxComplete_Handler

                PUBWEAK SPI1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI1_Handler
                B       SPI1_Handler

                PUBWEAK TMRA_5_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_5_Ovf_Udf_Handler
                B       TMRA_5_Ovf_Udf_Handler

                PUBWEAK TMRA_5_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_5_Cmp_Handler
                B       TMRA_5_Cmp_Handler

                PUBWEAK EVENT_PORT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT1_Handler
                B       EVENT_PORT1_Handler

                PUBWEAK EVENT_PORT2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT2_Handler
                B       EVENT_PORT2_Handler

                PUBWEAK EVENT_PORT3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT3_Handler
                B       EVENT_PORT3_Handler

                PUBWEAK EVENT_PORT4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT4_Handler
                B       EVENT_PORT4_Handler

                PUBWEAK USART3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART3_Handler
                B       USART3_Handler

                PUBWEAK USART3_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART3_TxComplete_Handler
                B       USART3_TxComplete_Handler

                PUBWEAK USART4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART4_Handler
                B       USART4_Handler

                PUBWEAK USART4_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART4_TxComplete_Handler
                B       USART4_TxComplete_Handler

                PUBWEAK SPI2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI2_Handler
                B       SPI2_Handler

                PUBWEAK SPI3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI3_Handler
                B       SPI3_Handler

                PUBWEAK EMB_GR0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR0_Handler
                B       EMB_GR0_Handler

                PUBWEAK EMB_GR1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR1_Handler
                B       EMB_GR1_Handler

                PUBWEAK EMB_GR2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR2_Handler
                B       EMB_GR2_Handler

