RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/IAR/startup_hc32f448.s
                PUBWEAK EMB_GR3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR3_Handler
                B       EMB_GR3_Handler

                PUBWEAK USART5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART5_Handler
                B       USART5_Handler

                PUBWEAK USART5_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART5_TxComplete_Handler
                B       USART5_TxComplete_Handler

                PUBWEAK USART6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART6_Handler
                B       USART6_Handler

                PUBWEAK USART6_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART6_TxComplete_Handler
                B       USART6_TxComplete_Handler

                PUBWEAK MCAN1_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN1_INT0_Handler
                B       MCAN1_INT0_Handler

                PUBWEAK MCAN1_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN1_INT1_Handler
                B       MCAN1_INT1_Handler

                PUBWEAK MCAN2_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN2_INT0_Handler
                B       MCAN2_INT0_Handler

                PUBWEAK MCAN2_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN2_INT1_Handler
                B       MCAN2_INT1_Handler

                PUBWEAK USART1_WKUP_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_WKUP_Handler
                B       USART1_WKUP_Handler

                PUBWEAK PWC_LVD1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_LVD1_Handler
                B       PWC_LVD1_Handler

                PUBWEAK PWC_LVD2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_LVD2_Handler
                B       PWC_LVD2_Handler

                PUBWEAK FCM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FCM_Handler
                B       FCM_Handler

                PUBWEAK WDT_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
WDT_Handler
                B       WDT_Handler

                PUBWEAK CTC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CTC_Handler
                B       CTC_Handler

                PUBWEAK ADC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC1_Handler
                B       ADC1_Handler

                PUBWEAK ADC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_Handler
                B       ADC2_Handler

                PUBWEAK ADC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC3_Handler
                B       ADC3_Handler

                PUBWEAK TRNG_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TRNG_Handler
                B       TRNG_Handler

                END
